# Topic 4 : Data Transformation (Sorting, Filtering, Applying Functions)

In [2]:
import numpy as np
import pandas as pd

## Task 1

In [7]:
data = {
    'Name': ['Alice', 'Bob', 'Charlie', 'David', 'Eva', 'Frank'],
    'Department': ['HR', 'IT', 'HR', 'IT', 'HR', 'IT'],
    'Score': [85, 90, 85, 88, 92, 88]
}

df = pd.DataFrame(data)
print(df)
df.sort_values(by=["Name", "Department"], ascending=True)
df.sort_values(by=["Name", "Department"], ascending=False)

      Name Department  Score
0    Alice         HR     85
1      Bob         IT     90
2  Charlie         HR     85
3    David         IT     88
4      Eva         HR     92
5    Frank         IT     88

      Name Department  Score
5    Frank         IT     88
4      Eva         HR     92
3    David         IT     88
2  Charlie         HR     85
1      Bob         IT     90
0    Alice         HR     85

## TAsk 2

In [8]:
data = {
    'Name': ['Alice', 'Bob', 'Charlie', 'David', 'Eva', 'Frank'],
    'Department': ['HR', 'IT', 'HR', 'IT', 'HR', 'IT'],
    'Score': [85, 90, 85, 88, 92, 88]
}
df = pd.DataFrame(data)
print(df)
df[df["Score"]>90]

      Name Department  Score
0    Alice         HR     85
1      Bob         IT     90
2  Charlie         HR     85
3    David         IT     88
4      Eva         HR     92
5    Frank         IT     88

  Name Department  Score
4  Eva         HR     92

## Task 3

In [9]:
data = {
    'Name': ['Alice', 'Bob', 'Charlie', 'David', 'Eva', 'Frank'],
    'Department': ['HR', 'IT', 'HR', 'IT', 'HR', 'IT'],
    'Score': [85, 90, 85, 88, 92, 88]
}
df = pd.DataFrame(data)
print(df)
df[(df["Score"]>85) & (df["Score"]<90)]

      Name Department  Score
0    Alice         HR     85
1      Bob         IT     90
2  Charlie         HR     85
3    David         IT     88
4      Eva         HR     92
5    Frank         IT     88

    Name Department  Score
3  David         IT     88
5  Frank         IT     88

## Task 4

In [10]:
data = {
    'Name': ['Alice', 'Bob', 'Charlie', 'David', 'Eva', 'Frank'],
    'Department': ['HR', 'IT', 'HR', 'IT', 'HR', 'IT'],
    'Score': [85, 90, 85, 88, 92, 88]
}
df = pd.DataFrame(data)
print(df)
df[df["Name"]=="Alice"]

      Name Department  Score
0    Alice         HR     85
1      Bob         IT     90
2  Charlie         HR     85
3    David         IT     88
4      Eva         HR     92
5    Frank         IT     88

    Name Department  Score
0  Alice         HR     85

## Task 5

In [12]:
data = {
    'Name': ['Alice', 'Bob', 'Charlie', 'David', 'Eva', 'Frank'],
    'Department': ['HR', 'IT', 'HR', 'IT', 'HR', 'IT'],
    'Score': [85, 90, 85, 88, 92, 88]
}
df = pd.DataFrame(data)
print(df)
df["Score"]=df["Score"].map(lambda x:0 if x<90 else x)
df

      Name Department  Score
0    Alice         HR     85
1      Bob         IT     90
2  Charlie         HR     85
3    David         IT     88
4      Eva         HR     92
5    Frank         IT     88

      Name Department  Score
0    Alice         HR      0
1      Bob         IT     90
2  Charlie         HR      0
3    David         IT      0
4      Eva         HR     92
5    Frank         IT      0

## Task 6

In [16]:
data = {
    'Name': ['Alice', 'Bob', 'Charlie', 'David', 'Eva', 'Frank'],
    'Department': ['HR', 'IT', 'HR', 'IT', 'HR', 'IT'],
    'Score': [85, 90, 85, 88, 92, 88]
}
df = pd.DataFrame(data)
print(df)
df["Result"]=np.where(df["Score"]<90, "Fail", "Pass")
df

      Name Department  Score
0    Alice         HR     85
1      Bob         IT     90
2  Charlie         HR     85
3    David         IT     88
4      Eva         HR     92
5    Frank         IT     88

      Name Department  Score Result
0    Alice         HR     85   Fail
1      Bob         IT     90   Pass
2  Charlie         HR     85   Fail
3    David         IT     88   Fail
4      Eva         HR     92   Pass
5    Frank         IT     88   Fail

## Task 7

In [19]:
data = {
    'ID': [1, 2, 3, 4, 5],
    'Score': [10, -5, 23, -12, 7]
}

df = pd.DataFrame(data)
df
df["Score"] = np.where(df["Score"]<0, 0, df["Score"])
df

   ID  Score
0   1     10
1   2      0
2   3     23
3   4      0
4   5      7

## Task 8

In [22]:
data = {
    'ID': [1, 2, 3, 4, 5],
    'Score': [50, 80, 65, 90, 70]
}

df = pd.DataFrame(data)
min_score=df["Score"].min()
max_score=df["Score"].max()
df["Normalize_score"]=(df["Score"]-min_score)/(max_score-min_score)
df

   ID  Score  Normalize_score
0   1     50            0.000
1   2     80            0.750
2   3     65            0.375
3   4     90            1.000
4   5     70            0.500

## Task 9

In [25]:
data = {
    'Name': ['Alice', 'Bob', 'Charlie'],
    'Math': [85, 70, 95],
    'Science': [90, 65, 88]
}

df = pd.DataFrame(data)
df
def result(df):
    avg=(df["Math"]+df["Science"])/2
    return "Fail" if avg<80 else "Pass"

df["Result"]=df.apply(result, axis=1)
df

      Name  Math  Science Result
0    Alice    85       90   Pass
1      Bob    70       65   Fail
2  Charlie    95       88   Pass

## Task 10

In [30]:
data = {
    'Name': ['Alice', 'Bob', 'Charlie', 'David', 'Eva'],
    'Age': [1, 18, 41, 33 , 61]
}
df = pd.DataFrame(data)
df
bins=[0,18,25, 40, 60]
labels=["Teen", "Youth", "Adult", "Old"]
df["Age_Remark"]=pd.cut(df["Age"], bins=bins, labels=labels)
df

      Name  Age Age_Remark
0    Alice    1       Teen
1      Bob   18       Teen
2  Charlie   41        Old
3    David   33      Adult
4      Eva   61        NaN

## Task 11

In [34]:
data = {
    'Name': ['Alice', 'Bob', 'Charlie', 'David', 'Eva', 'Frank', 'Grace', 'Helen'],
    'Score': [85, 90, 76, 88, 92, 67, 81, 95]
}

df = pd.DataFrame(data)
df
df.nlargest(5, "Score")
df.nsmallest(5, "Score")

      Name  Score
5    Frank     67
2  Charlie     76
6    Grace     81
0    Alice     85
3    David     88

## Task 12

In [37]:
data = {
    'Name': ['Alice', 'Bob', 'Charlie', 'David', 'Eva'],
    'Score': [85, 90, 85, 88, 92]
}

df = pd.DataFrame(data)
df["Rank"]=df["Score"].rank(ascending=False)
df

      Name  Score  Rank
0    Alice     85   4.5
1      Bob     90   2.0
2  Charlie     85   4.5
3    David     88   3.0
4      Eva     92   1.0

## Task 13

In [46]:
data = {
    'Name': ['Alice', 'Bob', 'Charlie', 'David'],
    'Department': ['HR', 'IT', 'Finance', 'HR']
}

df = pd.DataFrame(data)
df_dummy=pd.get_dummies(df["Department"], prefix="Dep").astype("int")
print(df_dummy)
combined_df=pd.concat([df, df_dummy], axis=1)
combined_df

   Dep_Finance  Dep_HR  Dep_IT
0            0       1       0
1            0       0       1
2            1       0       0
3            0       1       0

      Name Department  Dep_Finance  Dep_HR  Dep_IT
0    Alice         HR            0       1       0
1      Bob         IT            0       0       1
2  Charlie    Finance            1       0       0
3    David         HR            0       1       0

## Task 14

In [52]:
data = {
    'Name': ['Alice', 'Bob', 'Charlie', 'David', 'Eva'],
    'Score': [85, 90, 1000, 88, 92]  # 1000 is an outlier
}

df = pd.DataFrame(data)
# df.quantile
print(df)
def replace_outlier_with_median(df, cols):
    for col in cols:
        q1=df[col].quantile(0.25)
        q3=df[col].quantile(0.75)

        iqr=q3-q1
        lower_bound=q1-iqr*1.5
        upper_bound=q3+iqr*1.5
        df[col]=np.where((df[col]<lower_bound) | (df[col]>upper_bound), df[col].median(), df[col])
    return df
replace_outlier_with_median(df, cols=["Score"])

      Name  Score
0    Alice     85
1      Bob     90
2  Charlie   1000
3    David     88
4      Eva     92

      Name  Score
0    Alice   85.0
1      Bob   90.0
2  Charlie   90.0
3    David   88.0
4      Eva   92.0